Repository: linuxdeepin/deepin-kernel
Catalog: debian/templates/po/*.po
Languages: tr

source: Abort installation after depmod error?
tr: depmod hatasından sonra kurulum iptal edilsin mi?

source: The 'depmod' command exited with the exit code ${exit_value} (${SIGNAL}${CORE}).
tr: 'depmod' komutu ${exit_value} (${SIGNAL}${CORE}) çıkış koduyla sonlandı.

source: Since this image uses initrd, the ${modules_base}/=V/modules.dep file will not be deleted, even though it may be invalid.
tr: Bu görüntü initrd kullandığından ötürü ${modules_base}/=V/modules.dep dosyası, dosya geçersiz olsa da silinmeyecektir.

source: You should abort the installation and fix the errors in depmod, or regenerate the initrd image with a known good modules.dep file. If you don't abort the installation, there is a danger that the system will fail to boot.
tr: Ya kurulumu iptal edip depmod'daki hataları düzeltmeli ya da initrd görüntüsünü düzgün olduğu bilinen bir modules.dep dosyasıyla yeniden oluşturmalısınız. Kurulumu iptal etmediğiniz takdirde sisteminizin başlamama olasılığı vardır.

source: Abort kernel removal?
tr: Çekirdeği kaldırma işlemi iptal edilsin mi?

source: You are running a kernel (version ${running}) and attempting to remove the same version.
tr: Kullandığınız çekirdekle (${running}) aynı sürümdeki çekirdeği kaldırmaya çalışıyorsunuz.

source: This can make the system unbootable as it will remove /boot/vmlinuz-${running} and all modules under the directory /lib/modules/${running}. This can only be fixed with a copy of the kernel image and the corresponding modules.
tr: Bu eylem sisteminizi başlatılamaz hale getirebilir ( /boot/vmlinuz-${running} dosyasını ve /lib/modules/${running} dizinindeki tüm modülleri kaldıracağından dolayı). Bu durum yalnızca bir çekirdek görüntüsü ve bu görüntüye uygun modüller yardımıyla düzeltilebilir.

source: It is highly recommended to abort the kernel removal unless you are prepared to fix the system after removal.
tr: Kaldırma işlemi sonrasında sistemi düzeltmeye hazır olmadığınız takdirde kaldırma işleminden vazgeçmeniz şiddetle tavsiye edilir.

source: Required firmware files may be missing
tr: Gerekli aygıt yazılımları eksik

source: This system is currently running Linux ${runningversion} and you are installing Linux ${version}. In the new version some of the drivers used on this system may require additional firmware files:
tr: Bu sistem şu anda Linux ${runningversion} kullanıyor ve siz Linux ${version} sürümünü kurmak üzeresiniz. Yeni sürümde bu sistemde kullanmakta olduğunuz bazı sürücüler ek aygıt yazılımları (firmware) gerektirebilir:

source: Most firmware files are not included in the system because they do not conform to the Debian Free Software Guidelines. You may need to reconfigure the package manager to include the contrib and non-free sections of the package archive before you can install these firmware files.
tr: Çoğu aygıt yazılımı Debian Özgür Yazılım Yönergeleri'ne uymadığı için sisteme dahil edilmez. Bu aygıt yazılımlarını kurabilmek için öncelikle paket yöneticisini paket arşivinin contrib ve non-free kısımlarını kullanacak şekilde ayarlamanız gerekir.

source: Ramdisk configuration must be updated
tr: Ramdisk yapılandırılmasının güncellenmesi gerekli

source: Kernel packages will no longer run a specific ramdisk creator. The ramdisk creator package must install a script in /etc/kernel/postinst.d, and you should remove the line beginning 'ramdisk =' from /etc/kernel-img.conf.
tr: Çekirdek paketleri bundan böyle özel ramdisk oluşturucularını kullanamaz. ramdisk oluşturucu paket /etc/kernel/postinst.d konumuna bir betik kurmalıdır. Sizin de /etc/kernel-img.conf dosyasında 'ramdisk =' ile başlayan satırı kaldırmanız gerekmektedir.
