Repository: linuxdeepin/deepin-kernel
Catalog: debian/po/*.po
Languages: cs, da, et, nl, pl, pt, ru, sk, sv

source: Update disk device IDs in system configuration?
cs: Aktualizovat v nastavení systému ID diskových zařízení?
da: Opdater diskenheds-id'er i systemkonfigurationen?
et: Värskenda süsteemi seadetes ketta seadmete ID-d?
pt: Actualizar os IDs dos dispositivos de disco na configuração do sistema?
ru: Обновить ID дисковых устройств в настройках системы?
sv: Uppdatera diskenheters ID i systeminställningar?

source: The new Linux kernel version provides different drivers for some PATA (IDE) controllers. The names of some hard disk, CD-ROM, and tape devices may change.
cs: Nová verze Linuxového jádra přináší pro některé PATA (IDE) řadiče jiné ovladače. Názvy u některých pevných disků, CD-ROM a páskových mechanik se mohly změnit.
da: Den nye version af Linuxkernen har forskellige drivere for nogle PATA-kontrollere (IDE). Navnene på nogle harddiske, cd-rom og båndenheder kan skifte.
et: Uus Linuxi tuuma versioon pakub teistsuguseid nimesid mõnedele PATA (IDE) kontrolleritele. Osade kõvaketaste, CD-ROM-de ja lindiseadete nimed võivad muutuda.
pt: A nova versão de kernel Linux disponibiliza drivers diferentes para alguns controladores PATA (IDE). Os nomes de alguns discos rígidos, CD-ROM e dispositivos de fita magnética poderão mudar.
ru: Новая версия ядра Linux предоставляет другие драйверы для некоторых контроллеров PATA (IDE), в следствие чего могут измениться имена некоторых жёстких дисков, CD-ROM и ленточных накопителей.
sv: Den nya versionen av Linuxkärnan tillhandahåller olika drivrutiner för några PATA(IDE)-kontroller. Namnen på en del hårddiskar, CD-Rom- och band-enheter kan ändras.

source: It is now recommended to identify disk devices in configuration files by label or UUID (unique identifier) rather than by device name, which will work with both old and new kernel versions.
cs: Nyní je doporučeno v konfiguračních souborech označovat disková zařízení spíše než názvem zařízení raději popiskem či UUID (unikátním identifikátorem), což funguje jak se starou, tak i s novou verzí jádra.
da: Det anbefales, at du identificerer diskenheder i konfigurationsfiler med etiket eller UUID (unik identifikation) fremfor via enhedsnavn, som vil virke med både gamle og nye kerneversioner.
et: Nüüdsest on soovituslik konfiguratsioonifailides identifitseerida kettaid siltide või UUID (unikaalne idendifikaator) järgi, mitte seadme nime järgi. Nii töötavad nad nii vanade kui ka uute tuumadega.
pt: Agora é recomendado identificar os dispositivos de discos nos ficheiros de configuração pela etiqueta ou UUID (identificador único) em vez do nome de dispositivo, o qual irá funcionar com ambas versões de kernel antiga e nova.
ru: Теперь рекомендуется указывать дисковые устройства в файлах настроек в виде меток и UUID (уникальных идентификаторов), а не имён устройств. Это будет работать и в старых и в новых версиях ядер.
sv: Det är rekomenderat att identifiera diskenheter i konfigurationsfiler med ettikett eller UUID (unik identifierare) snarare än efter enhetsnamn. Ettikett och UUID fungerar både med nya och äldre verisioner av kärnan.

source: If you choose to not update the system configuration automatically, you must update device IDs yourself before the next system reboot or the system may become unbootable.
cs: Pokud se rozhodnete, že nechcete aktualizovat nastavení systému automaticky, musíte před příštím restartem systému aktualizovat ID zařízení ručně, jinak se systém může stát nezaveditelným.
da: Hvis du vælger at opdatere systemkonfigurationen automatisk, skal du selv opdatere enheds-id'er før systemets næste genstart eller også kan systemet måske ikke startes.
et: Kui valid mitte automaatselt uuendada süsteemi konfiguratsiooni, siis pead ise käsitsi muutma seadmete ID-d enne järgmist taaskäivitust või süsteem ei käivitu enam.
pt: Se escolher não actualizar a configuração do sistema automaticamente, você tem de actualizar os IDs dos dispositivos antes de reiniciar o sistema ou o sistema pode não arrancar.
ru: Если вы не выберете автоматическое обновление системных настроек, то должны обновить ID устройств самостоятельно до следующей перезагрузки, иначе система не запустится.
sv: Om du väljer att inte uppdatera systeminställningarna automatiskt måste du uppdatera enhets-ID själv innan nästa omstart av systemet annars kan systemet bli ostartbart.

source: Apply configuration changes to disk device IDs?
cs: Použít změny v nastavení ID diskových zařízení?
da: Anvend disse konfigurationsændringer til diskenheds-id'er?
et: Rakenda ketta seadmete ID-de konfiratsiooni muudatused?
pt: Aplicar estas alterações de configuração aos IDs de dispositivos de discos?
ru: Применить изменение настроек для ID дисковых устройств?
sv: Genomför förändring av enheternas ID?

source: These devices will be assigned UUIDs or labels:
cs: Těmto zařízením bude přiřazeno UUID či popisek:
da: Disse enheder vil få tildelt UUID'er eller etiketter:
et: Nendele seadmetele määratakse UUID-d või sildid:
pt: A estes dispositivos serão atribuídos UUIDs ou etiquetas:
ru: Следующим устройствам будут назначены UUID или метки:
sv: Dessa enheter kommer att få UUID eller ettiketter:

source: These configuration files will be updated:
cs: Tyto konfigurační soubory budou aktualizovány:
da: Disse konfigurationsfiler vil blive opdateret:
et: Need konfiguratsioonifailid uuendatakse:
pt: Estes ficheiros de configuração irão ser actualizados:
ru: Следующие файлы настройки будут обновлены:
sv: Dessa konfigurationsfiler kommer att uppdateras:

source: The device IDs will be changed as follows:
cs: ID diskových zařízení se změní následovně:
da: Enheds-id'erne vil blive ændret som vist i det følgende:
et: Seadme ID-d muudetakse järgnevalt:
pt: Os IDs de dispositivos irão ser alterados de acordo com o seguinte:
ru: ID устройств будут изменены следующим образом:
sv: Enhets-ID kommer att anges som följer:

source: Configuration files still contain deprecated device names
cs: Konfigurační soubory stále obsahují zastaralé názvy zařízení
da: Konfigurationsfiler inderholder stadig forældede enhedsnavne
et: Konfiguratsioonifailid sisaldavad ikka iganenud seadmete nimesid
pt: Os ficheiros de configuração ainda contêm nomes obsoletos de dispositivos
ru: Файлы настройки всё ещё содержат устаревшие имена устройств
sv: Konfigurationsfiler innehåller fortfarande utfasade enhetsnamn

source: The following configuration files still use some device names that may change when using the new kernel:
cs: Následující konfigurační soubory stále používají názvy zařízení, které je při používání nového jádra třeba změnit:
da: De følgende konfigurationsfiler bruger stadig nogle enhedsnavne som måske vil ændre sig, når den nye kerne bruges:
et: Järgnevad konfiguratsioonifailid sisaldavad ikka seadmete nimesid, mis võivad uue tuumaga muutuda:
pt: Os seguintes ficheiros de configuração ainda usam alguns nomes de dispositivos que podem alterar quando usar o novo kernel:
ru: В следующих файлах настройки всё ещё используются некоторые имена устройств, которые могут измениться при использовании нового ядра:
sv: Följande konfigurationsfiler använder fortfarande några enhetsnamn som kan komma att ändras med den nya kärnan:

source: Boot loader configuration check needed
cs: Je vyžadováno ověření nastavení zavaděče
da: Behov for tjek af opstartsindlæseren (boot loader)
et: Vajalik alglaaduri konfiguratsiooni kontroll
pt: Necessária verificação da configuração do gestor de arranque
ru: Требуется проверка настроек системного загрузчика
sv: Kontroll av konfigurationen i uppstartshanteraren behövs

source: The boot loader configuration for this system was not recognized. These settings in the configuration may need to be updated:
cs: Nastavení zavaděče v tomto systému nebylo rozpoznáno. Tato nastavení může být nutné aktualizovat:
da: Opstartslæserens (boot loader) konfiguration på dette system blev ikke genkendt. Disse indstillinger i konfigurationen skal måske opdateres:
et: Selle süsteemi alglaaduri konfiguratsiooni ei tuntud ära. Need konfiguratsiooniseaded võivad vajada uuendamist:
pt: A configuração do gestor de arranque para este sistema não foi reconhecida. Estas definições na configuração podem precisar de ser actualizadas:
ru: Не удалось определить настройки системного загрузчика данной системы. Следующие настройки может потребоваться изменить:
sv: Inställningarna för uppstartshanteraren i det här systemet kunde inte kännas igen. Dessa inställningar kan behöva uppdateras:

source: * The root device ID passed as a kernel parameter; * The boot device ID used to install and update the boot loader.
cs: * ID kořenového zařízení předané jako parametr jádra; * ID zaváděcího zařízení k instalaci a aktualizaci zavaděče.
da: * Rootenheds-id'et passeret som en kerneparameter; * Rootenheds-id'et brugt til at installere og opdatere opstartsindlæseren (boot loader)
et: * Root seadme ID edastatud kui tuuma parameeter; * Boot seadme ID, mida kasutati alglaaduri paigaldamisel ja uuendamisel.
pt: * O ID do dispositivo root passado como parâmetro do kernel * O ID do dispositivo boot usado para instalar e actualizar o gestor de arranque
ru: * ID корневого устройства, передаваемого параметром ядра; * ID загрузочного устройства, используемого для установки и обновления системного загрузчика.
sv: * rotenhetens ID som en parameter till kärnan * uppstartsenhetens ID som används för att installera och uppdatera uppstartshanteraren

source: You should generally identify these devices by UUID or label. However, on MIPS systems the root device must be identified by name.
cs: Tato zařízení bysta běžně měli označovat jejich UUID či popiskem. Na systémech MIPS však musí být kořenové zařízení označeno názvem.
da: Vi anbefaler, at du identificerer disse enheder efter UUID eller etiket. På MIPS-systemer skal rootenheden dog være identificeret med navn.
et: Üldjuhul peaks need seadmed identifitseerima UUID või sildi järgi. Kuid MIPS süsteemidel peab root seade olema idendifitseeritud nime järgi.
pt: Geralmente deve-se identificar estes dispositivos pelo UUID ou etiqueta. No entanto, em sistemas MIPS, o dispositivo root tem de ser identificado pelo nome.
ru: Обычно вы можете определить эти устройства по их UUID или метке. Однако, на системах MIPS корневое устройство должно быть определено по имени.
sv: Generellt sett ska dessa enheter identifierac med UUID eller ettikett. Dock måste rotenheten identifieras med namn på Mips-system.

source: Abort installation after depmod error?
cs: Přerušit po chybě depmod instalaci?
da: Afbryd installation efter depmod-fejl?
et: Katkesta paigaldus peale depmod veateadet?
nl: Installatie afbreken na depmod fout?
pl: Przerwać instalację po błędzie depmod?
pt: Abortar a instalação após erro do depmod?
ru: Прервать установку после ошибки depmod?
sk: Prerušiť inštaláciu po chybe depmod?
sv: Avbryt installation efter fel i depmod?

source: The 'depmod' command exited with the exit code ${exit_value} (${SIGNAL}${CORE}).
cs: Příkaz 'depmod' skončil s chybou ${exit_value} (${SIGNAL}${CORE}).
da: Kommandoen depmod afsluttedes med koden afslutningskoden ${exit_value} (${SIGNAL} ${CORE}).
et: 'depmod' käsk lõpetas väljumise koodiga ${exit_value} (${SIGNAL}${CORE}).
nl: De 'depmod' opdracht stopte met foutcode ${exit_value} (${SIGNAL}${CORE}).
pl: Polecenie "depmod" zakończyło się z kodem wyjścia ${exit_value} (${SIGNAL}${CORE}).
pt: O comando 'depmod' terminou com o código de erro ${exit_value} (${SIGNAL}${CORE}).
ru: Команда depmod завершилась с кодом ошибки ${exit_value} (${SIGNAL}${CORE}).
sk: Príkaz „depmod” skončil s návratovým kódom ${exit_value} (${SIGNAL}${CORE}).
sv: Kommandot "depmod" avslutades med felkod ${exit_value} (${SIGNAL}${CORE}).

source: Since this image uses initrd, the ${modules_base}/=V/modules.dep file will not be deleted, even though it may be invalid.
cs: Vzhledem k tomu, že tento obraz používá initrd, nebude soubor ${modules_base}/=V/modules.dep smazán, přesto že může být neplatný.
da: Da dette aftryk bruger initrd, vil filen ${modules_base}/=V/modules.dep ikke blive slettet, selvom den måske er ugyldig.
et: Kuna tõmmis kasutab initrd-d, siis ${modules_base}/=V/modules.dep faili ei kustutata, kuigi ta võib olla vigane.
nl: Omdat deze afbeelding initrd gebruikt, zal het ${modules_base}/=V/modules.dep bestand niet verwijderd worden, ook al is het niet correct.
pl: Ponieważ ten obraz używa initrd, plik ${modules_base}/=V/modules.dep nie zostanie usunięty, nawet jeśli może być nieprawidłowy.
pt: Como esta imagem usa initrd, o ficheiro ${modules_base}/=V/modules.dep não será apagado, apesar de poder ser inválido.
ru: Так как этот образ использует initrd, файл ${modules_base}/=V/modules.dep не будет удалён, даже если он может быть неправильным.
sk: Keďže tento obraz používa initrd, nebude súbor ${modules_base}/=V/modules.dep zmazaný, hoci môže byť neplatný.
sv: Eftersom denna avbildning använder initrd kommer inte filen ${modules_base}/=V/modules.dep att raderas, trots att den kan vara felaktig.

source: You should abort the installation and fix the errors in depmod, or regenerate the initrd image with a known good modules.dep file. If you don't abort the installation, there is a danger that the system will fail to boot.
cs: Měli byste přerušit instalaci a opravit chyby v depmod, nebo vytvořit obraz initrd s prověřeným souborem modules.dep. Nepřerušíte-li instalaci, vystavujete se riziku, že se nepodaří systém zavést.
da: Du skal afbryde installationen og rette fejlene i depmod, eller gendanne initrd-aftrykket med en kendt god fil af typen modules-dep. Hvis du ikke afbryder installationen, er der fare for at systemet vil fejle ved opstart.
et: Sa peaksid paigaldamise katkestama ja parandama depmodi vead või regenereerima initrd tõmmise heade modules.dep failiga. Kui sa ei katkesta, siis suure tõenäosusega süsteem enam ei käivitu alglaadimisel.
nl: U zou de installatie moeten afbreken en de fouten in depmod herstellen, of het initrd-bestand opnieuw moeten genereren met een correct modules.dep bestand. Als u de installatie niet afbreekt dan bestaat het gevaar dat het systeem niet zal starten.
pl: Należy przerwać instalację i naprawić błędy depmod lub wygenerować obraz initrd ponownie z poprawnym, znanym plikiem modules.dep. Jeśli instalacja nie zostanie przerwana, istnieje niebezpieczeństwo, że system może się nie uruchomić.
pt: Você deve abortar a instalação e corrigir os erros do depmod, ou gerar novamente a imagem initrd com um ficheiro modules.dep conhecido como bom. Se não abortar a instalação, existe o perigo do sistema falhar no arranque.
ru: Вы должны прервать установку и исправить ошибки depmod, или пересобрать образ initrd с работающим файлом modules.dep. Если вы не прервёте установку, то система больше не сможет загружаться.
sk: Mali by ste prerušiť inštaláciu a opraviť chyby v depmod, alebo znova vytvoriť obraz initrd s funkčným súborom modules.dep. Ak teraz neprerušíte inštaláciu, môže sa stať, že sa nepodarí zaviesť systém.
sv: Du bör avbryta installationen och laga felen i depmod eller skapa en ny initrd-avbildning med en fungerande modules.dep-fil. Om du inte avbryter installationen kan systemet hamna i ett läge där det inte kan starta.

source: Run the default boot loader?
cs: Spustit výchozí zavaděč?
da: Kør standardopstartsindlæseren?
pt: Correr o gestor de arranque predefinido?
ru: Запустить системный загрузчик по умолчанию?
sv: Kör uppstartshanteraren?

source: The default boot loader for this architecture is $loader, which is present.
cs: Výchozí nainstalovaný zavaděč pro tuto architekturu je $loader.
da: Standardopstartsindlæseren for denne arkitektur er $loader, som er til stede.
pt: O gestor de arranque predefinido para esta arquitectura é $loader, o qual está presente.
ru: Для данной архитектуры системным загрузчиком по умолчанию является $loader (уже установлен).
sv: Uppstartshanteraren för den här arkitekturen är $loader och den finns installerad.

source: However, there is no explicit request to run that boot loader in /etc/kernel-img.conf while GRUB seems to be installed with a postinst hook set.
cs: Nicméně, neexistuje žádný explicitní požadavek na spuštění zavaděče v /etc/kernel-img.conf, když byl po instalaci systému nainstalován a nastaven GRUB.
da: Der er dog ingen eksplicit krav om at køre den opstartsindlæser i /etc/kernel-img.conf mens GRUB ser ud til at være installeret med et postinst hooksæt.
pt: No entanto, não existe um pedido específico para correr esse gestor de arranque em /etc/kernel-img.conf embora o GRUB pareça estar instalado com um hook de pós-instalação definido.
ru: Однако нет явного указания запускать данный системный загрузчик в /etc/kernel-img.conf, так как, вероятно, GRUB установлен с помощью заключительного сценария установки пакета (postinst).
sv: Det finns dock ingen specifik begäran att köra uppstartshanteraren i filen /etc/kernel-img.conf medan GRUB verkar vara installerad med alternativet för uppdatering efter installaitonen angiven ("postinst hook").

source: It thus seems that this system is using GRUB as boot loader instead of $loader.
cs: Zdá se tedy, že tento systém používá místo $loader jako zavaděč GRUB.
da: Det ser ud til at dette system bruger GRUB som opstartsindlæser (boot loader) i steden for $loader.
pt: Assim, parece que este sistema usa o GRUB como gestor de arranque em vez de $loader.
ru: Вероятно, что на данной системе в качестве системного загрузчика используется GRUB, а не $loader.
sv: Det verkar därför som att detta system använder GRUB som uppstartshanterare istället för $loader.

source: Please choose which should run: the default boot loader now, or the GRUB update later.
cs: Zvolte prosím, který se má spustit: současný výchozí zavaděč, nebo později aktualizovaný GRUB.
da: Vælg venligst hvilken der skal køre: Standardopstartsindlæseren nu, eller GRUB-opdatering senere.
pt: Por favor escolha qual deve correr: o gestor de arranque predefinido agora, ou a actualização ao GRUB mais tarde.
ru: Выберите что нужно запускать: системный загрузчик по умолчанию прямо сейчас или позднее GRUB.
sv: Ange vad som ska köras, standardhanteraren för uppstart nu eller GRUB vid ett senare tillfälle.

source: Error running the boot loader in test mode
cs: Chyba při spouštění zavaděče v testovacím režimu
da: Fejl ved kørsel af opstartsindlæseren i testtilstand
pt: Erro ao correr o gestor de arranque em modo de teste
ru: Ошибка при работе системного загрузчика в тестовом режиме
sv: Fel vid körning av uppstartshanteraren i testläge

source: An error occurred while running the ${loader} boot loader in test mode.
cs: Při spouštění zavaděče ${loader} v testovacím režimu nastala chyba.
da: En fejl opstod under kørsel af opstartsindlæseren ${loader} i testtilstand.
pt: Ocorreu um erro ao correr o gestor de arranque ${loader} em modo de teste.
ru: При работе системного загрузчика ${loader} в тестовом режиме произошла ошибка.
sv: Ett fel uppstod när uppstartshanteraren ${loader} skulle köras i testläge.

source: A log is available in ${temp_file_name}. Please edit /etc/${loader}.conf manually and re-run ${loader} to fix that issue and keep this system bootable.
cs: Log je dostupný v ${temp_file_name}. Pro opravení této chyby a zachování zaveditelnosti systému, prosím ručně upravte /etc/${loader}.conf a znovu spusťte ${loader}.
da: En log er tilgængelig i ${temp_file_name}. Rediger venligst /etc/${loader}.conf manuelt og genkør ${loader} for at rette dette og sikre at dette system stadig kan startes op.
pt: Está disponível um relatório em ${temp_file_name}. Por favor edite o /etc/${loader}.conf manualmente e execute de novo ${loader} para corrigir esse problema e manter este sistema de forma a que possa arrancar.
ru: Журнал работы доступен в файле ${temp_file_name}. Отредактируйте /etc/${loader}.conf вручную и перезапустите ${loader} для исправления ошибки и сохранения загрузочного состояния системы.
sv: En logg finns i ${temp_file_name}. Redigera filen /etc/${loader}.conf manuellt och kör sedan ${loader} på nytt för att laga felet och hålla systemet startbart.

source: Error running the boot loader
cs: Chyba při spouštění zavaděče
da: Fejl ved kørsel af opstartsindlæseren
pt: Erro ao correr o gestor de arranque
ru: Ошибка при работе системного загрузчика
sv: Fel vid körning av uppstartshanteraren

source: An error occurred while running the ${loader} boot loader.
cs: Při spouštění zavaděče ${loader} nastala chyba.
da: En fejl opstod under kørsel af opstartsindlæseren ${loader}.
pt: Ocorreu um erro ao correr o gestor de arranque ${loader}.
ru: При работе системного загрузчика ${loader} произошла ошибка.
sv: Ett fel uppstod när uppstartshanteraren ${loader} skulle köras.

source: Abort kernel removal?
cs: Přerušit odstraňování jádra?
da: Afbryd kernefjernelse?
et: Katkesta tuuma eemaldamine?
nl: Het verwijderen van de kernel afbreken?
pl: Przerwać usuwanie jądra?
pt: Abortar a remoção do kernel?
ru: Прервать удаление ядра?
sk: Prerušiť odstraňovanie jadra?
sv: Avbryt radering av kärnan?

source: You are running a kernel (version ${running}) and attempting to remove the same version.
cs: Pokoušíte se odstranit verzi jádra (version ${running}), která nyní běží.
da: Du kører en kerne (version ${running}) og forsøger at fjerne den samme version.
et: Sa kasutad tuuma versiooni (version ${running}) ning üritad seda sama versiooni eemaldada.
nl: U gebruikt kernel (versie ${running}) en probeert dezelfde versie te verwijderen.
pl: Aktualnie używane jest jądro (wersja ${running}) i próbuje się usunąć tę samą wersję.
pt: Você está a correr um kernel (versão ${running}) e a tentar remover essa mesma versão.
ru: Вы пытаетесь удалить запущенную версию ядра (${running}).
sk: Pokúšate sa odstrániť rovnakú verziu jadra, akú práve používate (version ${running}).
sv: Den kärna du kör (version ${running}) och den du försöker ta bort är samma version.
