Repository: linuxdeepin/deepin-kernel
Catalog: debian/po/*.po
Languages: cs, da, et, nl, pl, pt, ru, sk, sv

source: This can make the system unbootable as it will remove /boot/vmlinuz-${running} and all modules under the directory /lib/modules/${running}. This can only be fixed with a copy of the kernel image and the corresponding modules.
cs: To může způsobit, že se nepodaří zavést systém, a také bude odstraněno /boot/vmlinuz-${running} a všechny moduly v adresáři /lib/modules/${running}. Toto je možné opravit pouze nakopírováním obrazu jádra a příslušných modulů.
da: Dette kan gøre at systemet ikke kan starte op da det vil fjerne /boot/vmlinuz-${running} og alle moduler i mappen /lib/modules//${running}. Dette kan kun rettes med en kopi af kerneaftrykket og de tilsvarende moduler.
et: See võib süsteemi muuta mitte käivitatavaks kuna eemaldatakse /boot/vmlinuz-${running} ja kõik moodulid kataloogist /lib/modules/${running}. Seda saab parandada ainult sama tumma ja vastavate moodulite kopeerimisega õigetesse kohtadesse.
nl: Het resultaat kan zijn dat het systeem niet start omdat het /boot/vmlinuz-${running} en alle modules onder /lib/modules/${running} verwijdert. Dit kan alleen gerepareerd worden met een kopie van het kernel bestand en de bijbehorende modules.
pl: Skutkiem mogą być problemy z rozruchem systemu, ponieważ zostanie usunięty /boot/vmlinuz-${running} i wszystkie moduły z katalogu /lib/modules/${running}. Jedynym rozwiązaniem w takim wypadku jest skopiowanie obrazu jądra i towarzyszących mu modułów.
pt: Isto pode fazer com que o sistema não arranque porque irá remover /boot/vmlinuz-${running} e todos os módulos no directório /lib/modules/${running}. Isto só pode ser corrigido com uma cópia da imagem do kernel e dos correspondentes módulos.
ru: Это может привести к неспособности загрузки системы, так как будут удалён файл /boot/vmlinuz-${running} и все модули из каталога /lib/modules/${running}. Это можно будет исправить только копированием образа ядра и соответствующих модулей.
sk: Toto môže spôsobiť, že sa systém nezavedie, pretože bude odstránený /boot/vmlinuz-${running} a všetky moduly z adresára /lib/modules/${running}. Opravené to môže byť len prekopírovaním obrazu jadra a príslušných modulov.
sv: Detta kan göra systemet ostartbart eftersom det kommer att innebära att /boot/vmlinuz-${running} och alla moduler i /lib/modules/${running} raderas. Detta kan endast återställas med en kopia av kärnavbildningen och motsvarande moduler.

source: It is highly recommended to abort the kernel removal unless you are prepared to fix the system after removal.
cs: Je silně doporučeno přerušit odstraňování jádra, pokud nejste připraveni opravovat systém po jeho odstranění.
da: Det anbefales stærkt, at afbryde kernefjernelsen med mindre du er forberedt på at rette systemet op efter fjernelsen.
et: On äärmiselt soovituslik katkestada tuuma eemaldamine, kui sa just pole valmistunud süsteemi ise parandama.
nl: Het wordt ten sterkste aanbevolen om het verwijderen van de kernel af te breken tenzij u bent voorbereid om het systeem te repareren na het verwijderen.
pl: Jest wysoce zalecane, aby przerwać usuwanie jądra, chyba że użytkownik jest przygotowany do naprawy systemu po usunięciu.
pt: É altamente recomendado abortar a remoção do kernel a menos que esteja preparado para corrigir o sistema após a remoção.
ru: Настоятельно рекомендуется прервать удаление ядра, если вы не готовы чинить систему после его удаления.
sk: Dôrazne odporúčame prerušiť odstraňovanie jadra, ak nie ste pripravený na opravu systému po jeho odstránení.
sv: Det rekomenderas starkt att du avbryter raderingen av kärnan om du inte är beredd på att laga systemet efter raderingen.

source: This system uses a valid /etc/${loader}.conf file that mentions ${kimage}-=V. Removing linux-image-=V will invalidate that file.
cs: Tento systém používá platný soubor /etc/${loader}.conf, který obsahuje ${kimage}-=V. Odstranění linux-image-=V tento soubor zneplatní.
da: Dette system bruger en gyldig /etc/${loader}.conf-fil som nævner ${kimage}-=V. Fjernelse af linux-image-=V vil invalidere den fil.
pt: Este sistema usa um ficheiro /etc/${loader}.conf válido que menciona ${kimage}-=V. Remover linux-image-=V irá invalidar esse ficheiro.
ru: В данной системе используется корректный файл /etc/${loader}.conf, в котором указано ${kimage}-=V. Удаление linux-image-=V сделает файл некорректным.
sv: Detta system använder en korrekt /etc/${loader}.conf-fil som pekar ut ${kimage}-=V. Att ta bort linux-image-=V kommer göra filen inaktuell.

source: You will need to edit /etc/${loader}.conf or re-target symbolic links mentioned there (typically, /vmlinuz and /vmlinuz.old) to not refer to ${kimage}-=V. Then, you will have to re-run ${loader}.
cs: Bude potřeba, abyste upravili /etc/${loader}.conf, nebo přesměrovali symbolické odkazy, které jsou zde uvedené (běžně /vmlinuz a /vmlinuz.old), aby neodkazovaly na ${kimage}-=V. Potom musíte znovu spustit ${loader}.
da: Du vil skulle redigere /etc//${loader}.conf eller geninstallere symbolske henvisninger nævnt der (typisk, /vmlinuz og /vmlinuz.old) til ikke at referere til ${kimage}-=V. Derefter skal du genkøre ${loader}.
pt: Você precisa de editar o /etc/${loader}.conf ou re-orientar os links simbólicos mencionados lá (tipicamente, /vmlinuz and /vmlinuz.old) para não apontarem para ${kimage}-=V. Depois terá que executar novamente o ${loader}.
ru: Вам будет нужно отредактировать /etc/${loader}.conf или переназначить символьные ссылки, упомянутые там (обычно, /vmlinuz и /vmlinuz.old), на неуказывающие на ${kimage}-=V. Затем нужно перезапустить ${loader}.
sv: Du måte redigera filen /etc/${loader}.conf eller ställa om symboliska länkar som omnämns där (vanligen /vmlinuz och /vmlinuz.old) så att de inte pekar på ${kimage}-=V. Därefter ska du åter köra ${loader}.

source: Required firmware files may be missing
cs: Mohou chybět potřebné soubory s firmwarem
da: Krævet firmwarefiler mangler måske
et: Vajalikud püsivara failid võivad olla puudu
nl: De vereiste firmware-bestanden kunnen ontbreken
pl: Wymagane pliki firmware mogą być niedostępne
pt: Podem estar em falta ficheiros de firmware necessários
ru: Могут отсутствовать необходимые файлы микропрограмм
sk: Vyžadované súbory s firmware môžu chýbať
sv: Firmware-filer som krävs kan saknas

source: This system is currently running Linux ${runningversion} and you are installing Linux ${version}. In the new version some of the drivers used on this system may require additional firmware files:
cs: Systém nyní běží na Linuxu ${runningversion} a vy instalujete Linux ${version}. V nové verzi mohou některé ovladače používané v tomto systému, vyžadovat dodatečné soubory s firmwarem:
da: Dette system kører aktuelt Linux ${runningversion}, og du installerer Linux ${version}. I den nye version kræver nogle af driverne på dette system måske yderligere firmwarefiler:
et: See süsteem kasutab praegu Linuxi versiooni ${runningversion} ja sina paigaldad versiooni ${version}. Uues versionis võivad mõned ajurid vajada lisaks püsivara faile:
nl: Het systeem draait op dit moment Linux ${runningversion} en u installeert Linux ${version}. In de nieuwe versie kunnen enkele stuurprogramma's van het systeem aparte firmware-bestanden nodig hebben.
pl: System działa obecnie na jądrze Linux ${runningversion}, a instalowany jest Linux ${version}. W nowej wersji niektóre ze sterowników używanych przez system, mogą wymagać dodatkowych plików firmware:
pt: Este sistema está actualmente a correr Linux ${runningversion} e você está a instalar Linux ${version}. Na nova versão algumas das drivers usadas neste sistema podem necessitar dos ficheiros de firmware adicionais:
ru: В этой системе сейчас работает ядро Linux ${runningversion} и производится установка Linux ${version}. В новой версии некоторым драйверам, используемым в данной системе, могут потребоваться дополнительные файлы микропрограмм:
sk: Tento systém práve používa Linux ${runningversion} a vy inštalujete Linux ${version}. V novej verzii môžu niektoré ovládače používané týmto systémom vyžadovať dodatočné súbory s firmware:
sv: Detta system kör Linux ${runningversion} och du installerar Linux ${version}. I den nya versionen kan vissa drivrutiner behöva ytterligare firmware-filer:

source: Most firmware files are not included in the system because they do not conform to the Debian Free Software Guidelines. You may need to reconfigure the package manager to include the contrib and non-free sections of the package archive before you can install these firmware files.
cs: Většina souborů s firmwarem není zahrnuta v systému, protože nejsou v souladu se Zásadami svobodného softwaru Debianu. Než budete moci tyto soubory s firmwarem nainstalovat, budete možná muset nastavit správce balíčků, aby zahrnoval archiv sekce balíčků non-free.
da: De fleste firmwarefiler er ikke inkluderet i Debiansystemet, da de ikke overholder Debian Free Softwares retningslinjer. Du skal måske rekonfigurere pakkehåndteringen for at inkludere contrib og det ikke frie afsnit af Debianarkivet, før du kan installere disse firmwarefiler.
et: Enamik püsivara faile ei ole kaasatud süsteemi, sest nad ei vasta Debian vaba tarkvara juhtnööridele (Debian Free Software Guidelines). Võimalik, et pead enne oma pakimajandajat ümber seadistama, et kaasata varamutesse ka contrib ja non-free harud, kui saad need püsivara failid paigaldada.
nl: Veel firmware-bestanden zijn niet in het systeem opgenomen omdat zij niet voldoen aan de Debian Richtlijnen voor Vrije Software (DFSG). Mogelijk moet u de configuratie van de pakketbeheerprogramma aanpassen en de contrib en non-free secties van het pakketarchief toevoegen voordat u deze firmware bestanden kunt installeren.
pl: Większość plików firmware nie jest dołączonych do systemu, ponieważ nie spełniają Wytycznych Debiana dotyczących Wolnego Oprogramowania. Może zajść potrzeba ponownej konfiguracji menedżera pakietów, aby dołączyć sekcje contrib i non-free archiwum pakietów, przed możliwością zainstalowania potrzebnych plików firmware.
pt: A maioria dos ficheiros de firmware não estão incluídos no sistema porque não respeitam as Guidelines da Debian Free Software. Você pode precisar de reconfigurar o gestor de pacotes para incluir as secções contrib e non-free do arquivo de pacotes antes de poder instalar estes ficheiros de firmware.
ru: Большинства файлов микропрограмм нет в дистрибутиве, так как они не удовлетворяют критериям свободного ПО Debian. Для установки этих файлов из архива вам может потребоваться перенастроить менеджер пакетов, чтобы включить разделы contrib и non-free.
sk: Väčšina súborov s firmware nie je v systéme zahrnutá, pretože nie sú v súlade so Zásadami slobodného softvéru Debianu. Pred inštaláciou týchto súborov s firmware, budete možno musieť nastaviť správcu balíkov tak, aby zahŕňal sekcie archívu balíkov contrib a non-free.
sv: På grund av bestämmelserna i Debian Free Software Guidelines kan de flesta firmware-filer inte inkluderas i systemet. Du kan behöva anpassa pakethanteraren för att inkludera sektionerna "contrib" och "non-free" i paketarkivet innan du kan installera dessa filer.

source: Ramdisk configuration must be updated
nl: De ramdisk-configuratie moet worden aangepast.
pl: Konfiguracja ramdisku musi zostać zaktualizowana
sk: Nastavenie ramdisku musí byť aktualizované

source: Kernel packages will no longer run a specific ramdisk creator. The ramdisk creator package must install a script in /etc/kernel/postinst.d, and you should remove the line beginning 'ramdisk =' from /etc/kernel-img.conf.
nl: Kernel pakketten starten niet langer een bepaalde ramdisk generator. Het ramdisk generator pakket moet een script in /etc/kernel/postinst.d installeren en u dient de regel te verwijderen die begint met 'ramdisk =' uit /etc/kernel-img.conf.
pl: Pakiety jądra nie uruchamiają dłużej specjalnego kreatora ramdisku. Pakiet kreatora ramdisku musi zainstalować skrypt w /etc/kernel/postinst.d, a użytkownik powinien usunąć wszystkie wiersze zaczynające się od "ramdisk =" z pliku /etc/kernel-img.conf.
sk: Balíky jadra už nebudú viac spúšťať vytváranie špecifického ramdisku. Nástroj na vytváranie ramdisku musí nainštalovať skript do /etc/kernel/postinst.d a vy musíte odstrániť riadok, ktorý začína „ramdisk =” z /etc/kernel-img.conf.
